wyniki_10G_article/fio_results_ext4_nvme/block_size_2048/lab-sec-8/fio_seq_write_article_test_output.txt
seq_write_article_test: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
fio-3.36
Starting 1 process
seq_write_article_test: Laying out IO file (1 file / 10240MiB)

seq_write_article_test: (groupid=0, jobs=1): err= 0: pid=67113: Sun Apr 20 14:46:09 2025
  write: IOPS=21.1k, BW=82.3MiB/s (86.3MB/s)(14.5GiB/180001msec); 0 zone resets
    slat (usec): min=2, max=32874, avg= 7.64, stdev=20.94
    clat (nsec): min=1973, max=56444k, avg=38563.32, stdev=279146.44
     lat (usec): min=18, max=56449, avg=46.21, stdev=281.42
    clat percentiles (usec):
     |  1.00th=[   26],  5.00th=[   28], 10.00th=[   29], 20.00th=[   29],
     | 30.00th=[   30], 40.00th=[   30], 50.00th=[   31], 60.00th=[   32],
     | 70.00th=[   32], 80.00th=[   33], 90.00th=[   33], 95.00th=[   34],
     | 99.00th=[   41], 99.50th=[   50], 99.90th=[ 1876], 99.95th=[ 4752],
     | 99.99th=[14353]
   bw (  KiB/s): min=  295, max=107984, per=100.00%, avg=84312.84, stdev=15743.72, samples=359
   iops        : min=   73, max=26996, avg=21078.21, stdev=3935.98, samples=359
  lat (usec)   : 2=0.01%, 10=0.01%, 20=0.02%, 50=99.48%, 100=0.22%
  lat (usec)   : 250=0.08%, 500=0.01%, 750=0.04%, 1000=0.04%
  lat (msec)   : 2=0.02%, 4=0.02%, 10=0.04%, 20=0.03%, 50=0.01%
  lat (msec)   : 100=0.01%
  cpu          : usr=6.02%, sys=19.46%, ctx=3792002, majf=0, minf=14
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,3791975,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=82.3MiB/s (86.3MB/s), 82.3MiB/s-82.3MiB/s (86.3MB/s-86.3MB/s), io=14.5GiB (15.5GB), run=180001-180001msec

Disk stats (read/write):
  nvme0n1: ios=0/3793655, sectors=0/31233676, merge=0/866, ticks=0/172014, in_queue=172112, util=68.55%